/**********************************************************************************//**
	@file           List_ManualTest.h
	@brief          GoogleTest手動テストコードの書き方サンプル定義、宣言   
	@note Copyright (c) FromSoftware, Inc.
*//***********************************************************************************/

#if !defined ___TECHTRAINING_CHAPTER2_LIST_MANUAL_TEST___
#define      ___TECHTRAINING_CHAPTER2_LIST_MANUAL_TEST___

//--------------------------------------------------------------------------------
// ファイル依存関係
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
// マクロ定義
//--------------------------------------------------------------------------------
// コンパイル関連手動テスト(リスト)

// ※コンパイルが通れば成功
//#define TT_TEST_GET_DATA_NUM_IS_CONST

// ※コンパイルが通らなければ成功
//#define TT_TEST_INSERT_WHEN_CONST



#endif // ___TECHTRAINING_CHAPTER2_LIST_MANUAL_TEST___